P2-P3-P4/gestor_personajes_armadura/app/controllers/personajes_controller.rb

    def index
        @personajes = Personaje.all
---
SELECT "personajes".* FROM "personajes"