P2-P3-P4/gestor_personajes_armadura/app/controllers/personajes_controller.rb

SELECT "personajes".* FROM "personajes" WHERE "personajes"."usuario" = ?  [["usuario", "Jaime"]]
SELECT COUNT(*) FROM "personajes" WHERE "personajes"."usuario" = ?  [["usuario", "Jaime"]]
---
    def index
        #@personajes = Personaje.all
        @personajes = Personaje.where(usuario: params[:usuario])
        logger.info "Cargando personajes para usuario: #{params[:usuario]}, Total: #{@personajes.count}"

INSERT INTO "armaduras" ("tipo", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["tipo", "Hierro"], ["created_at", "2024-05-18 11:35:00.773476"], ["updated_at", "2024-05-18 11:35:00.773476"]]
INSERT INTO "personajes" ("arma", "habilidad", "tipoPersonaje", "usuario", "armadura_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        armadura = Armadura.find_or_create_by(armadura_params)
        @personaje = Personaje.new(personaje_params.except(:armadura))
        @personaje.armadura = armadura
        if @personaje.save

SELECT "personajes".* FROM "personajes" WHERE "personajes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "armaduras".* FROM "armaduras" LIMIT ?  [["LIMIT", 1]]
SELECT "personajes".* FROM "personajes"
UPDATE "personajes" SET "armadura_id" = ?, "updated_at" = ? WHERE "personajes"."id" = ?  [["armadura_id", 1], ["updated_at", "2024-05-20 14:52:07.195174"], ["id", 23]]
---
    def update
        @personaje = Personaje.find(params[:id])

        if params[:personaje].present? && params[:personaje][:armadura].present?
            armadura = Armadura.find_or_create_by(armadura_params)
            @personaje.armadura = armadura
        end

        if @personaje.update(personaje_params.except(:armadura))

SELECT "personajes".* FROM "personajes" WHERE "personajes"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
DELETE FROM "personajes" WHERE "personajes"."id" = ?  [["id", 21]]
---
    def destroy
        personaje = Personaje.find(params[:id])
        if personaje.destroy